probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void descriptionFn() {
  String str = "<root><specVersion><major>1</major><minor>0</minor></specVersion><URLBase>http://" + ipString + ":80/</URLBase><device><deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType><friendlyName>Philips hue (" + ipString + ")</friendlyName><manufacturer>Royal Philips Electronics</manufacturer><manufacturerURL>http://www.philips.com</manufacturerURL><modelDescription>Philips hue Personal Wireless Lighting</modelDescription><modelName>Philips hue bridge 2012</modelName><modelNumber>929000226503</modelNumber><modelURL>http://www.meethue.com</modelURL><serialNumber>00178817122c</serialNumber><UDN>uuid:2f402f80-da50-11e1-9b23-00178817122c</UDN><presentationURL>index.html</presentationURL><iconList><icon><mimetype>image/png</mimetype><height>48</height><width>48</width><depth>24</depth><url>hue_logo_0.png</url></icon><icon><mimetype>image/png</mimetype><height>120</height><width>120</width><depth>24</depth><url>hue_logo_3.png</url></icon></iconList></device></root>";
  HTTP.send(200, "text/plain", str);
  Serial.println(str);
}

void unimpFn(WcFnRequestHandler *handler, String requestUri) {
  String str = "{}";
  HTTP.send(200, "text/plain", str);
  Serial.println(str);
}

void addConfigJson(aJsonObject *config);
void sendJson(aJsonObject *config);
void configFn(WcFnRequestHandler *handler, String requestUri) {
  aJsonObject *root;
  root = aJson.createObject();
  addConfigJson(root);
  sendJson(root);
}

void sendSuccess(String name, String value);
void authFn(WcFnRequestHandler *handler, String requestUri) {
  // On the real bridge, the link button on the bridge must have been recently pressed for the command to execute successfully.
  // We try to execute successfully regardless of a button for now.
  sendSuccess("username", "api");
}

aJsonObject *getGroupJson();
aJsonObject *getSceneJson();
void addLightsJson(aJsonObject *config);
void wholeConfigFn(WcFnRequestHandler *handler, String requestUri) {
  // Serial.println("Respond with complete json as in https://github.com/probonopd/ESP8266HueEmulator/wiki/Hue-API#get-all-information-about-the-bridge");
  aJsonObject *root;
  root = aJson.createObject();
  // the default group 0 is never listed
  aJson.addItemToObject(root, "groups", getGroupJson());
  aJson.addItemToObject(root, "scenes", getSceneJson());
  aJsonObject *config;
  aJson.addItemToObject(root, "config", config = aJson.createObject());
  addConfigJson(config);
  aJsonObject *lights;
  aJson.addItemToObject(root, "lights", lights = aJson.createObject());
  addLightsJson(lights);
  aJsonObject *schedules;
  aJson.addItemToObject(root, "schedules", schedules = aJson.createObject());
  aJsonObject *sensors;
  aJson.addItemToObject(root, "sensors", sensors = aJson.createObject());
  aJsonObject *rules;
  aJson.addItemToObject(root, "rules", rules = aJson.createObject());
  sendJson(root);
}

void sceneListingHandler();
void scenesGetFn(WcFnRequestHandler *handler, String requestUri) {
  sceneListingHandler();
}

void sceneCreationHandler(String body);
void scenesPostFn(WcFnRequestHandler *handler, String requestUri) {
  sceneCreationHandler("");
}

void sendError(int type, String path, String description);
void scenesAnyFn(WcFnRequestHandler *handler, String requestUri) {
  sendError(4, requestUri, "Scene method not supported");
}

int findSceneIndex(String id);
LightGroup *findScene(String id);
bool updateSceneSlot(int slot, String id, String body);
void sendSuccess(String text);
void scenesIdGetFn(WcFnRequestHandler *handler, String requestUri) {
  String sceneId = handler->getWildCard(1);
  LightGroup *scene = findScene(sceneId);
  if (scene) {
    sendJson(scene->getSceneJson());
  } else {
    sendError(3, "/scenes/"+sceneId, "Cannot retrieve scene that does not exist");
  }
}

void sceneCreationHandler(String sceneId);
void sendUpdated();
void scenesIdPutFn(WcFnRequestHandler *handler, String requestUri) {
  String sceneId = handler->getWildCard(1);
  // validate body, delete old group, create new group
  sceneCreationHandler(sceneId);
  // XXX not a valid response according to API
  sendUpdated();
}

void scenesIdDeleteFn(WcFnRequestHandler *handler, String requestUri) {
  String sceneId = handler->getWildCard(1);
  LightGroup *scene = findScene(sceneId);
  if (scene) {
    updateSceneSlot(findSceneIndex(sceneId), sceneId, "");
  } else {
    sendError(3, requestUri, "Cannot delete scene that does not exist");
  }
  sendSuccess(requestUri+" deleted");
}

void scenesIdLightFn(WcFnRequestHandler *handler, String requestUri) {
  // XXX Do something with this information...
  // XXX not a valid response according to API
  sendUpdated();
}

void LightServiceClass::begin() {
  macString = String(WiFi.macAddress());
  bridgeIDString = macString;
  bridgeIDString.replace(":", "");
  bridgeIDString = bridgeIDString.substring(0, 6) + "FFFE" + bridgeIDString.substring(6);
  ipString = StringIPaddress(WiFi.localIP());
  netmaskString = StringIPaddress(WiFi.subnetMask());
  gatewayString = StringIPaddress(WiFi.gatewayIP());

  Serial.print("Starting HTTP at ");
  Serial.print(WiFi.localIP());
  Serial.print(":");
  Serial.println(80);

  HTTP.on("/description.xml", HTTP_GET, descriptionFn);
  on(configFn, "/api/*/config", HTTP_GET);
  on(configFn, "/api/config", HTTP_GET);
  on(wholeConfigFn, "/api/*", HTTP_GET);
  on(authFn, "/api", HTTP_GET);
  on(unimpFn, "/api/*/schedules", HTTP_GET);
  on(unimpFn, "/api/*/rules", HTTP_GET);
  on(unimpFn, "/api/*/sensors", HTTP_GET);
  on(scenesGetFn, "/api/*/scenes", HTTP_GET);
  on(scenesPostFn, "/api/*/scenes", HTTP_POST);
  on(scenesAnyFn, "/api/*/scenes", HTTP_ANY);
  on(scenesIdGetFn, "/api/*/scenes/*", HTTP_GET);
  on(scenesIdPutFn, "/api/*/scenes/*", HTTP_PUT);
  on(scenesIdDeleteFn, "/api/*/scenes/*", HTTP_DELETE);
  on(scenesAnyFn, "/api/*/scenes/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lightstates/*", HTTP_PUT);
  on(scenesAnyFn, "/api/*/scenes/*/lightstates/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lights/*/state", HTTP_PUT);
  on(scenesAnyFn, "/api/*/scenes/*/lights/*/state", HTTP_ANY);
  HTTP.onNotFound(handleAllOthers);

  HTTP.begin();

