probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  if (uri.startsWith("lightstates/") || uri.startsWith("lights/")) {
    uri = uri.substring(12);
    if (HTTP.method() != HTTP_POST && HTTP.method() != HTTP_PUT) {
      // error, only POST allowed
      sendError(4, "/api/" + user + "/scenes/" + sceneId + "/lightstates", "Only PUT and POST supported for scenes/*/light*");
      return;
    }
    // XXX Do something with this information...
    // XXX not a valid response according to API
    sendUpdated();
  }
}

void wholeConfigHandler(String user, String uri) {
  // Serial.println("Respond with complete json as in https://github.com/probonopd/ESP8266HueEmulator/wiki/Hue-API#get-all-information-about-the-bridge");
  aJsonObject *root;
  root = aJson.createObject();
  // the default group 0 is never listed
  aJson.addItemToObject(root, "groups", getGroupJson());
  aJson.addItemToObject(root, "scenes", getSceneJson());
  aJsonObject *config;
  aJson.addItemToObject(root, "config", config = aJson.createObject());
  addConfigJson(config);
  aJsonObject *lights;
  aJson.addItemToObject(root, "lights", lights = aJson.createObject());
  addLightsJson(lights);
  aJsonObject *schedules;
  aJson.addItemToObject(root, "schedules", schedules = aJson.createObject());
  aJsonObject *sensors;
  aJson.addItemToObject(root, "sensors", sensors = aJson.createObject());
  aJsonObject *rules;
  aJson.addItemToObject(root, "rules", rules = aJson.createObject());
  sendJson(root);
}

void descriptionHandler(String user, String uri) {
  WiFiClient client = HTTP.client();
  String str = "<?xml version=\"1.0\"?><root><specVersion><major>1</major><minor>0</minor></specVersion><URLBase>http://" + ipString + ":80/</URLBase><device><deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType><friendlyName>Philips hue (" + ipString + ")</friendlyName><manufacturer>Royal Philips Electronics</manufacturer><manufacturerURL>http://www.philips.com</manufacturerURL><modelDescription>Philips hue Personal Wireless Lighting</modelDescription><modelName>Philips hue bridge 2012</modelName><modelNumber>929000226503</modelNumber><modelURL>http://www.meethue.com</modelURL><serialNumber>00178817122c</serialNumber><UDN>uuid:2f402f80-da50-11e1-9b23-00178817122c</UDN><presentationURL>index.html</presentationURL><iconList><icon><mimetype>image/png</mimetype><height>48</height><width>48</width><depth>24</depth><url>hue_logo_0.png</url></icon><icon><mimetype>image/png</mimetype><height>120</height><width>120</width><depth>24</depth><url>hue_logo_3.png</url></icon></iconList></device></root>";
  HTTP.send(200, "text/xml", str);
  Serial.println(str);
}

String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

void handleAllOthers() {
  Serial.print("=== ");
  Serial.println(millis());
  Serial.print("Method: ");
  Serial.println(methodToString(HTTP.method()));
  String fullUri = trimSlash(HTTP.uri());
  Serial.print("requestedUri: ");
  Serial.println(fullUri);

  // make sure /api is there, rip it off along with trailing slash if present
  if (!fullUri.startsWith("api")) {
    // bail, unimplemented
    HTTP.send(200, "text/plain", "{}");
    Serial.println("FIXME: To be implemented");
    return;
  }
  fullUri.remove(0, 3);
  fullUri = trimSlash(fullUri);
  // get user
  String user;
  int userEnd = fullUri.indexOf('/');
  if (userEnd == -1) {
    user = fullUri;
    fullUri = "";
  } else {
    user = fullUri.substring(0, userEnd);
    fullUri.remove(0, userEnd);
  }
  String requestedUri = trimSlash(fullUri);
  if (requestedUri.endsWith("/")) {
    requestedUri = requestedUri.substring(0, requestedUri.length() - 1);
  }
  // requestedUri is remaining path, no leading or trailing slash
  Serial.print("URI: ");
  Serial.println(requestedUri);

  if (requestedUri.startsWith("lights")) {
    lightsHandler(user, requestedUri);
  } else if (requestedUri.startsWith("groups")) {
    groupsHandler(user, requestedUri);
  } else {
    HTTP.send(200, "text/plain", "()");
    Serial.println("FIXME: To be implemented");

    // Print what the client has POSTed
    for (uint8_t i = 0; i < HTTP.args(); i++) Serial.printf("ARG[%u]: %s=%s\n", i, HTTP.argName(i).c_str(), HTTP.arg(i).c_str());
  }
  Serial.println(millis());
}

